Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel
Interaction logic for WpfOkApplyModifyGetOnOffCancel.xaml
WpfOkApplyModifyGetOnOffCancel

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.#ctor
Constructor

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.OkClicked
The OkClicked event is raised when the Ok button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.ApplyClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.ModifyClicked
The ModifyClicked event is raised when the Modify button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.GetClicked
The GetClicked event is raised when the Get button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.OnOffClicked
The OnOffClicked event is raised when the OnOff button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel.InitializeComponent
InitializeComponent